{
  "projects": [
    {
      "name": "Validating JSON Documents with Learned VPAs",
      "description": "Implementation of oracles to actively learn a JSON document from a JSON schema, of an algorithm to validate streaming JSON documents against a schema, and benchmarks to compare our algorithm and the classical algorithm.\n\nSee our paper \"Validating Streaming JSON Documents with Learned VPAs\" for more information.\nSee also the project \"JSON Schema Tools\" for the classical algorithm.",
      "homepage": "https://github.com/DocSkellington/ValidatingJSONDocumentsWithLearnedVPA"
    },
    {
      "name": "JSON Schema Tools",
      "description": "Implementation of tools to manipulate JSON schemas, to generate (randomly or exhaustively) JSON documents from a schema, and to validate a JSON document against a schema.\n\nSee our paper \"Validating Streaming JSON Documents with Learned VPAs\" for more information.\n\nSee also the project \"Validating JSON Documents with Learned VPAs\" for a new validation algorithm.",
      "homepage": "https://github.com/DocSkellington/JSONSchemaTools"
    },
    {
      "name": "Learning Realtime One-Counter Automata",
      "description": "Implementation of an active automata learning for realtime one-counter automata, and benchmarks based on randomly generated automata and on JSON documents.\n\nSee our paper \"Learning Realtime One-Counter Automata\" for more information.",
      "homepage": "https://github.com/DocSkellington/LStar-ROCA-Benchmarks"
    },
    {
      "name": "Learning Visibly One-Computer Automata",
      "description": "Implementation of an active learning algorithm dedicated to visibly one-counter automata, based on a paper by Daniel Neider and Christof Löding: [Learning Visibly One-Counter Automata in Polynomial Time](http://ftp.informatik.rwth-aachen.de/ftp/pub/publications/rwth/informatik/2010/2010-02.pdf).\n\nThis project was realized during my internship at UAntwerpen, under the supervision of Guillermo A. Pérez",
      "homepage": "https://github.com/DocSkellington/LearningVCA"
    }
  ]
}